type GenreId =
  | 28
  | 12
  | 16
  | 35
  | 80
  | 99
  | 18
  | 10751
  | 14
  | 36
  | 27
  | 10402
  | 9648
  | 10749
  | 878
  | 10770
  | 53
  | 10752
  | 37;

type GenreName =
  | "アクション"
  | "アドベンチャー"
  | "アニメ"
  | "コメディ"
  | "犯罪"
  | "ドキュメンタリー"
  | "ドラマ"
  | "ファミリー"
  | "ファンタジー"
  | "歴史"
  | "ホラー"
  | "音楽"
  | "ミステリー"
  | "ロマンス"
  | "SF"
  | "TV映画"
  | "スリラー"
  | "戦争"
  | "西部劇";

// ジャンルIDと名前のマッピング
export const genreMap: Record<GenreId, GenreName> = {
  28: "アクション",
  12: "アドベンチャー",
  16: "アニメ",
  35: "コメディ",
  80: "犯罪",
  99: "ドキュメンタリー",
  18: "ドラマ",
  10751: "ファミリー",
  14: "ファンタジー",
  36: "歴史",
  27: "ホラー",
  10402: "音楽",
  9648: "ミステリー",
  10749: "ロマンス",
  878: "SF",
  10770: "TV映画",
  53: "スリラー",
  10752: "戦争",
  37: "西部劇",
};

// ジャンルIDをジャンル名に変換する関数
export const getGenreNames = (genreIds: number[]): string => {
  return genreIds.map((id) => genreMap[id as GenreId] || "--").join(", ");
};
